tap "1password/tap"
tap "axiomhq/tap"
tap "borkdude/brew"
tap "buildpacks/tap"
tap "buo/cask-upgrade"
tap "chipmk/tap"
tap "clojure/tools"
tap "daipeihust/tap"
tap "deepsourcelabs/cli"
tap "gabotechs/taps"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "infisical/get-cli"
tap "jakehilborn/jakehilborn"
tap "jdxcode/tap"
tap "jesseduffield/lazydocker"
tap "macos-fuse-t/cask"
tap "mediar-ai/screenpipe", "https://github.com/mediar-ai/screenpipe.git"
tap "moonrepo/tap"
tap "nakabonne/ali"
tap "nikitabobko/tap"
tap "noborus/tap"
tap "oven-sh/bun"
tap "pantsbuild/tap"
tap "reviewdog/tap"
tap "vectordotdev/brew"
tap "weihanglo/sfz", "https://github.com/weihanglo/sfz.git"
tap "xpipe-io/tap"
brew "luarocks"
brew "git-cliff"
brew "act"
brew "age"
brew "age-plugin-yubikey"
brew "brotli"
brew "ast-grep"
brew "aws-shell"
brew "cryptography"
brew "awscli"
brew "icu4c@76"
brew "bitwarden-cli", link: false
brew "bottom"
brew "btop"
brew "caddy"
brew "cargo-udeps"
brew "certbot"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "php"
brew "composer"
brew "container-diff"
brew "d2"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker", link: false
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "doggo"
brew "dotnet"
brew "dua-cli"
brew "duckdb"
brew "dufs"
brew "duti"
brew "erdtree"
brew "fd"
brew "svt-av1"
brew "flatbuffers"
brew "fzf"
brew "gallery-dl"
brew "gh"
brew "git-delta"
brew "gitui"
brew "gleam"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "gource"
brew "graphviz"
brew "hadolint"
brew "helix"
brew "hey"
brew "htmlq"
brew "htop"
brew "httpstat"
brew "libomp", link: true
brew "imagemagick"
brew "infracost"
brew "ios-webkit-debug-proxy"
brew "iproute2mac"
brew "jaq"
brew "jj"
brew "jless"
brew "jnv"
brew "jq"
brew "jql"
brew "kalker"
brew "kondo"
brew "lazygit"
brew "llvm"
brew "lsd"
brew "macos-trash"
brew "mariadb", restart_service: true
brew "mas"
brew "mcfly"
brew "mise"
brew "mkcert"
brew "mold"
brew "mosh"
brew "yt-dlp"
brew "mpv"
brew "mycli"
brew "navi"
brew "ncdu"
brew "neovim"
brew "node", link: false
brew "nss"
brew "ntfy"
brew "nushell"
brew "oha"
brew "ouch"
brew "packer"
brew "pandoc"
brew "parallel"
brew "pdfpc"
brew "pipe-rename"
brew "pipx"
brew "pomsky"
brew "pwgen"
brew "python-yq"
brew "python@3.11"
brew "pytorch"
brew "radare2"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "ruff"
brew "rustscan"
brew "sad"
brew "sbom-tool"
brew "sccache"
brew "scrcpy"
brew "sd"
brew "silicon", link: false
brew "sniffnet"
brew "starship"
brew "step"
brew "syft"
brew "tailspin"
brew "telnet"
brew "tere"
brew "terraform"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "trippy"
brew "typos-cli"
brew "typst"
brew "uv"
brew "wasm-pack"
brew "wasmer"
brew "watch"
brew "wget"
brew "winetricks"
brew "wireshark"
brew "woff2"
brew "xh"
brew "xplr"
brew "ijq"
brew "yubico-piv-tool"
brew "zig"
brew "zoxide"
brew "axiomhq/tap/axiom"
brew "borkdude/brew/babashka"
brew "buildpacks/tap/pack"
brew "chipmk/tap/docker-mac-net-connect"
brew "clojure/tools/clojure"
brew "daipeihust/tap/im-select"
brew "gabotechs/taps/dep-tree"
brew "infisical/get-cli/infisical"
brew "jakehilborn/jakehilborn/displayplacer"
brew "jesseduffield/lazydocker/lazydocker"
brew "mediar-ai/screenpipe/screenpipe"
brew "nakabonne/ali/ali"
brew "noborus/tap/ov"
brew "oven-sh/bun/bun"
brew "reviewdog/tap/reviewdog"
brew "vectordotdev/brew/vector"
brew "weihanglo/sfz/sfz"
cask "1password-cli"
cask "aerospace"
cask "altair-graphql-client"
cask "android-platform-tools"
cask "angry-ip-scanner"
cask "appcleaner"
cask "applite"
cask "audacity"
cask "bruno"
cask "calibre"
cask "cutter"
cask "db-browser-for-sqlite"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "easy-move+resize"
cask "figma"
cask "finch"
cask "font-fontawesome"
cask "font-iosevka-nerd-font"
cask "fuse-t"
cask "fuse-t-sshfs"
cask "ghidra"
cask "github"
cask "hashicorp-vagrant"
cask "iterm2"
cask "jellyfin-media-player"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kdenlive"
cask "keycastr"
cask "kid3"
cask "logseq"
cask "lulu"
cask "mac-mouse-fix"
cask "macfuse"
cask "mediahuman-audio-converter"
cask "meld"
cask "minecraft"
cask "obs"
cask "openvpn-connect"
cask "orbstack"
cask "pants"
cask "postman"
cask "raycast"
cask "silicon"
cask "sourcetrail"
cask "sourcetree"
cask "squirrel"
cask "steam"
cask "synology-chat"
cask "synology-drive"
cask "tad"
cask "telegram"
cask "temurin"
cask "transmission-remote-gui"
cask "universal-android-debloater"
cask "vagrant"
cask "veracrypt"
cask "vidcutter"
cask "vivaldi@snapshot"
cask "vlc"
cask "vmware-fusion"
cask "warp"
cask "xpipe"
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Furtherance", id: 1659277200
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "LocalSend", id: 1661733229
mas "Log-Viewer", id: 1543753042
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "Red Lines Tools", id: 1469400117
mas "RunCat", id: 1429033973
mas "ScreenBrush", id: 1233965871
mas "Shareful", id: 1522267256
mas "TickTick", id: 966085870
mas "Trello", id: 1278508951
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "adamraichu.zip-viewer"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.iconify"
vscode "asvetliakov.vscode-neovim"
vscode "azemoh.one-monokai"
vscode "bceskavich.theme-dracula-at-night"
vscode "bibhasdn.git-easy"
vscode "bierner.emojisense"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "efanzh.graphviz-preview"
vscode "elijah-potter.harper"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.css-stacking-contexts"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "gaborv.flatbuffers"
vscode "gerane.theme-dark-dracula"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hars.cppsnippets"
vscode "heybourn.headwind"
vscode "jerryhong.autofilename"
vscode "jock.svg"
vscode "jzarzoso.break-from-comma"
vscode "kaiwood.endwise"
vscode "karunamurti.tera"
vscode "lokalise.i18n-ally"
vscode "mathcale.theme-dracula-refined"
vscode "matthewpi.caddyfile-support"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "moonrepo.moon-console"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "nhoizey.gremlins"
vscode "nicoespeon.abracadabra"
vscode "pkief.material-icon-theme"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "robotpajamas.vscode-suspenders"
vscode "rust-lang.rust-analyzer"
vscode "seanwu.apache-arrow"
vscode "shadowtime2000.eta-vscode"
vscode "shan.code-settings-sync"
vscode "stephanvs.dot"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "terrastruct.d2"
vscode "tonka3000.raycast"
vscode "usernamehw.errorlens"
vscode "waderyan.babelrc"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
vscode "zamerick.vscode-caddyfile-syntax"
