tap "adembc/tap"
tap "appleboy/tap"
tap "borkdude/brew"
tap "buildpacks/tap"
tap "buo/cask-upgrade"
tap "clojure/tools"
tap "coder/coder"
tap "daipeihust/tap"
tap "deepsourcelabs/cli"
tap "gabotechs/taps"
tap "grafana/grafana"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "iagooar/qqqa"
tap "infisical/get-cli"
tap "jakehilborn/jakehilborn"
tap "jdxcode/tap"
tap "jesseduffield/lazydocker"
tap "jfryy/tap"
tap "jwt-rs/jwt-ui"
tap "kgarner7/feishin"
tap "macos-fuse-t/cask"
tap "moonrepo/tap"
tap "nakabonne/ali"
tap "nikitabobko/tap"
tap "noborus/tap"
tap "oven-sh/bun"
tap "pantsbuild/tap"
tap "raggi/ale"
tap "reviewdog/tap"
tap "sst/tap"
tap "th-ch/youtube-music"
tap "tw93/tap"
tap "wickenico/wailbrew"
brew "act"
brew "age"
brew "age-plugin-yubikey"
brew "brotli"
brew "ca-certificates"
brew "ast-grep"
brew "atuin"
brew "aws-shell"
brew "awscli"
brew "biome"
brew "bitwarden-cli"
brew "bottom"
brew "btop"
brew "caddy"
brew "cargo-dist"
brew "cargo-udeps"
brew "cryptography"
brew "certbot"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "php"
brew "composer"
brew "d2"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker", link: false
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "doggo"
brew "dotnet"
brew "dotslash"
brew "dua-cli"
brew "duckdb"
brew "dufs"
brew "duti"
brew "erdtree"
brew "fd"
brew "svt-av1"
brew "flatbuffers"
brew "fnox"
brew "fzf"
brew "gallery-dl"
brew "gh"
brew "git-cliff"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "gleam"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "gopass"
brew "gource"
brew "graphviz"
brew "hadolint"
brew "helix"
brew "hexyl"
brew "htmlq"
brew "htop"
brew "httpstat"
brew "hyperfine"
brew "icu4c@76"
brew "jq"
brew "ijq"
brew "libomp", link: true
brew "imagemagick"
brew "infisical"
brew "infracost"
brew "ios-webkit-debug-proxy"
brew "iproute2mac"
brew "jaq"
brew "jj"
brew "jless"
brew "jnv"
brew "jql"
brew "jqp"
brew "just"
brew "k6"
brew "kalker"
brew "kondo"
brew "lazygit"
brew "lefthook"
brew "llvm"
brew "lsd"
brew "luarocks"
brew "macos-trash", link: true
brew "mariadb", restart_service: :changed
brew "mas"
brew "mcfly"
brew "miller"
brew "mise"
brew "mkcert"
brew "mold"
brew "moon"
brew "mosh"
brew "yt-dlp"
brew "mpv"
brew "mycli"
brew "navi"
brew "ncdu"
brew "neovim"
brew "nss"
brew "ntfy"
brew "nushell"
brew "oha"
brew "opencode"
brew "openjdk"
brew "ouch"
brew "ov"
brew "pandoc"
brew "parallel"
brew "pdfpc"
brew "pgcli"
brew "pipe-rename"
brew "pipx"
brew "pomsky"
brew "proto"
brew "pwgen"
brew "python-yq"
brew "python@3.11"
brew "pytorch"
brew "radare2"
brew "rage"
brew "rbw"
brew "rclone"
brew "redis"
brew "renovate"
brew "ripgrep"
brew "ruby"
brew "ruff"
brew "rustscan"
brew "sad"
brew "sbom-tool"
brew "sccache"
brew "scrcpy"
brew "sd"
brew "sheldon"
brew "silicon"
brew "sniffnet"
brew "spacer"
brew "starship"
brew "step"
brew "superfile"
brew "syft"
brew "tailspin"
brew "television"
brew "telnet"
brew "tere"
brew "termscp"
brew "timg"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "trippy"
brew "typos-cli"
brew "typst"
brew "typtea"
brew "uv"
brew "viddy"
brew "wasm-pack"
brew "wasmer"
brew "watch"
brew "wget"
brew "winetricks"
brew "wireshark"
brew "woff2"
brew "xh"
brew "xplr"
brew "yazi"
brew "yubico-piv-tool"
brew "zig"
brew "zoxide"
brew "adembc/tap/lazyssh"
brew "appleboy/tap/codegpt"
brew "borkdude/brew/babashka"
brew "buildpacks/tap/pack"
brew "clojure/tools/clojure"
brew "coder/coder/coder"
brew "daipeihust/tap/im-select"
brew "gabotechs/taps/dep-tree"
brew "gromgit/brewtils/taproom"
brew "hashicorp/tap/packer"
brew "iagooar/qqqa/qqqa"
brew "jakehilborn/jakehilborn/displayplacer"
brew "jesseduffield/lazydocker/lazydocker"
brew "jfryy/tap/qq", link: false
brew "jwt-rs/jwt-ui/jwt-ui"
brew "nakabonne/ali/ali"
brew "oven-sh/bun/bun"
brew "raggi/ale/openssl-osx-ca"
brew "reviewdog/tap/reviewdog"
brew "tw93/tap/mole"
cask "aerospace"
cask "altair-graphql-client"
cask "android-platform-tools"
cask "android-studio"
cask "anytype"
cask "appcleaner"
cask "applite"
cask "atuin-desktop"
cask "audacity"
cask "bluestacks"
cask "bruno"
cask "cap"
cask "claude-code"
cask "context"
cask "cryptomator"
cask "cutter"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "easy-move+resize"
cask "emby"
cask "feishin"
cask "figma"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "fuse-t"
cask "fuse-t-sshfs"
cask "ghostty"
cask "gimp"
cask "github"
cask "grayjay"
cask "hashicorp-vagrant"
cask "iterm2"
cask "jellyfin-media-player"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kdenlive"
cask "keycastr"
cask "kid3"
cask "krita"
cask "libreoffice"
cask "logseq"
cask "loop"
cask "lulu"
cask "mac-mouse-fix"
cask "macfuse"
cask "mediahuman-audio-converter"
cask "meld"
cask "minecraft"
cask "obs"
cask "opal-app"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "orbstack"
cask "pants"
cask "postman"
cask "raycast"
cask "selfcontrol"
cask "shortcat"
cask "silicon-app"
cask "slack"
cask "sourcetree"
cask "squirrel-app"
cask "stats"
cask "super-productivity"
cask "synology-chat"
cask "synology-drive"
cask "tad"
cask "telegram"
cask "temurin"
cask "transmission-remote-gui"
cask "universal-android-debloater"
cask "utm"
cask "vagrant"
cask "veracrypt"
cask "vlc"
cask "wailbrew"
cask "yaak"
cask "youtube-music"
mas "AdGuard for Safari", id: 1440147259
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "LocalSend", id: 1661733229
mas "Log-Viewer", id: 1543753042
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "Pets Therapy", id: 1575542220
mas "Red Lines Tools", id: 1469400117
mas "RunCat", id: 1429033973
mas "Saber", id: 1671523739
mas "ScreenBrush", id: 1233965871
mas "Shareful", id: 1522267256
mas "TickTick", id: 966085870
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "adamraichu.zip-viewer"
vscode "adonisjs.vscode-edge"
vscode "alefragnani.project-manager"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "azemoh.one-monokai"
vscode "bceskavich.theme-dracula-at-night"
vscode "bibhasdn.git-easy"
vscode "bierner.emojisense"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bytecodealliance.wit-idl"
vscode "chakrounanas.turbo-console-log"
vscode "charkoal.charkoal"
vscode "charliermarsh.ruff"
vscode "coder.coder-remote"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dioxuslabs.dioxus"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "drkryz.rustautomod"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "efanzh.graphviz-preview"
vscode "effectful-tech.effect-vscode"
vscode "elijah-potter.harper"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.css-stacking-contexts"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "fregante.ghost-text"
vscode "fwcd.kotlin"
vscode "gaborv.flatbuffers"
vscode "gavinleroy.argus"
vscode "gerane.theme-dark-dracula"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "hverlin.mise-vscode"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "inlang.vs-code-extension"
vscode "jakebecker.elixir-ls"
vscode "jerryhong.autofilename"
vscode "jock.svg"
vscode "jzarzoso.break-from-comma"
vscode "kahole.magit"
vscode "kaiwood.endwise"
vscode "kamikillerto.vscode-colorize"
vscode "karunamurti.tera"
vscode "kisstkondoros.vscode-codemetrics"
vscode "lokalise.i18n-ally"
vscode "marimo-team.vscode-marimo"
vscode "markwhen.markwhen"
vscode "mathcale.theme-dracula-refined"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mitsuhiko.insta"
vscode "moonrepo.moon-console"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "muhammad-ahmad.xlsx-viewer"
vscode "nefrob.vscode-just-syntax"
vscode "nhoizey.gremlins"
vscode "nicoespeon.abracadabra"
vscode "nuxt.mdc"
vscode "panicbit.cargo"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-yaml"
vscode "rikurouvila.typehole"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "seanwu.apache-arrow"
vscode "shadowtime2000.eta-vscode"
vscode "slint.slint"
vscode "sst-dev.opencode"
vscode "statelyai.stately-vscode"
vscode "stephanvs.dot"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tekumara.typos-vscode"
vscode "tendoualice.markdown-obsidian-callout"
vscode "terrastruct.d2"
vscode "thang-nm.flow-icons"
vscode "tonka3000.raycast"
vscode "typespec.typespec-vscode"
vscode "ultram4rine.vscode-choosealicense"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "william-voyek.vscode-nginx"
vscode "windmill-labs.windmill"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "zamerick.vscode-caddyfile-syntax"
go "github.com/jimschubert/delete-artifacts/cmd"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
