tap "appleboy/tap"
tap "buo/cask-upgrade"
tap "dopplerhq/cli"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "iagooar/qqqa"
tap "jakehilborn/jakehilborn"
tap "jr-k/d4s"
tap "jwt-rs/jwt-ui"
tap "kgarner7/feishin"
tap "ksdme/tap"
tap "macos-fuse-t/cask"
tap "manaflow-ai/cmux"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "raggi/ale"
tap "restatedev/tap"
tap "wader/tap"
tap "wickenico/wailbrew"

# Essential
brew "age"
brew "age-plugin-yubikey"
brew "atuin"
brew "chezmoi"
brew "direnv"
brew "fd"
brew "fnox"
brew "fzf"
brew "gh"
brew "git-extras"
brew "git-lfs"
brew "jnv"
brew "jq"
brew "lsd"
brew "macos-trash", link: true
brew "mas"
brew "mise"
brew "ouch"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "topgrade"
brew "xh"
brew "zoxide"
cask "ghostty"

# Recommended
brew "ast-grep"
brew "bat"
brew "bitwarden-cli"
brew "d2"
brew "difftastic"
brew "dufs"
brew "git-cliff"
brew "jj"
brew "lazygit"
brew "lazyjj"
brew "lazyssh"
brew "yazi"
cask "appcleaner"
cask "atuin-desktop"
cask "bruno"

# Languages and Development Tools
brew "biome"
brew "cargo-dist"
brew "cmake"
brew "composer"
brew "gleam"
brew "go"
brew "openjdk"
brew "php"
brew "pipx"
brew "pomsky"
brew "python@3.11"
brew "ruby"
brew "ruff"
brew "uv"
cask "android-platform-tools"
cask "android-studio"

# Others
brew "appleboy/tap/codegpt"
brew "bottom"
brew "brotli"
brew "btop"
brew "ca-certificates"
brew "caddy"
brew "certbot"
brew "clipboard"
brew "coder"
brew "cryptography"
brew "dive"
brew "docker", link: false
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "dopplerhq/cli/doppler"
brew "dua-cli"
brew "duckdb"
brew "duti"
brew "exiftool"
brew "flatbuffers"
brew "gallery-dl"
brew "gnupg"
brew "graphviz"
brew "gromgit/brewtils/taproom"
brew "hadolint"
brew "helix"
brew "hexyl"
brew "htop"
brew "hwatch"
brew "hyperfine"
brew "iagooar/qqqa/qqqa"
brew "icu4c@76"
brew "imagemagick"
brew "iproute2mac"
brew "jakehilborn/jakehilborn/displayplacer"
brew "jr-k/d4s/d4s"
brew "just"
brew "jwt-rs/jwt-ui/jwt-ui"
brew "k6"
brew "ksdme/tap/ut"
brew "libomp", link: true
brew "libpq", link: true
brew "luarocks"
brew "mask"
brew "mkcert"
brew "mold"
brew "mole"
brew "moon"
brew "mosh"
brew "mprocs"
brew "mycli"
brew "neovim"
brew "nss"
brew "opencode"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "parallel"
brew "pgcli"
brew "pkgconf"
brew "poppler"
brew "prek"
brew "proto"
brew "pwgen"
brew "python-yq"
brew "radare2"
brew "rage"
brew "raggi/ale/openssl-osx-ca"
brew "rbw"
brew "rclone"
brew "restatedev/tap/restate"
brew "restatedev/tap/restate-server"
brew "sccache"
brew "scrcpy"
brew "snitch"
brew "step"
brew "svt-av1"
brew "syft"
brew "telnet"
brew "tokei"
brew "trippy"
brew "trufflehog"
brew "typos-cli"
brew "typst"
brew "typtea"
brew "viddy"
brew "wader/tap/fq"
brew "watch"
brew "watchman"
brew "wget"
brew "wireshark"
brew "woff2"
brew "xplr"
brew "yt-dlp"
brew "yubico-piv-tool"
cask "anytype"
cask "applite"
cask "audacity"
cask "cap"
cask "codex"
cask "context"
cask "cryptomator"
cask "cutter"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "easy-move+resize"
cask "figma"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "fuse-t"
cask "gimp"
cask "github"
cask "hashicorp/tap/hashicorp-vagrant"
cask "imageoptim"
cask "iterm2"
cask "jellyfin-media-player"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kdenlive"
cask "kdiff3"
cask "keycastr"
cask "kgarner7/feishin/feishin"
cask "kid3"
cask "krita"
cask "libreoffice"
cask "logseq"
cask "lulu"
cask "mac-mouse-fix"
cask "macos-fuse-t/cask/fuse-t-sshfs"
cask "manaflow-ai/cmux/cmux"
cask "mediahuman-audio-converter"
cask "meld"
cask "minecraft"
cask "nikitabobko/tap/aerospace"
cask "obs"
cask "opal-app"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "orbstack"
cask "osaurus"
cask "raycast"
cask "selfcontrol"
cask "shortcat"
cask "silicon-app"
cask "slack"
cask "sourcetree"
cask "squirrel-app"
cask "stats"
cask "super-productivity"
cask "synology-chat"
cask "synology-drive"
cask "tad"
cask "telegram"
cask "temurin"
cask "universal-android-debloater"
cask "vagrant"
cask "veracrypt-fuse-t"
cask "wailbrew"
cask "zettlr"
cask "zoom"

mas "AdGuard Mini", id: 1440147259
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "LocalSend", id: 1661733229
mas "Log-Viewer", id: 1543753042
mas "Numbers", id: 409203825
mas "Numbers", id: 361304891
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "Pets Therapy", id: 1575542220
mas "Red Lines Tools", id: 1469400117
mas "RunCat", id: 1429033973
mas "Saber", id: 1671523739
mas "ScreenBrush", id: 1233965871
mas "Shareful", id: 1522267256
mas "TickTick", id: 966085870
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650

vscode "13xforever.language-x86-64-assembly"
vscode "1yib.rust-bundle"
vscode "a5huynh.vscode-ron"
vscode "aaron-bond.better-comments"
vscode "adam-bender.commit-message-editor"
vscode "adamraichu.zip-viewer"
vscode "adonisjs.vscode-edge"
vscode "adpyke.codesnap"
vscode "alanmunson.one-monokai-tweaked"
vscode "alefragnani.project-manager"
vscode "alexdima.vscode-lcov"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.browse-lite"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "arcanis.vscode-zipfs"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "azemoh.one-monokai"
vscode "bceskavich.theme-dracula-at-night"
vscode "be5invis.toml"
vscode "bibhasdn.git-easy"
vscode "bierner.emojisense"
vscode "bierner.lit-html"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-image-size"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "blackboxapp.blackbox"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bytecodealliance.wit-idl"
vscode "castwide.solargraph"
vscode "cduruk.thrift"
vscode "chakrounanas.turbo-console-log"
vscode "charkoal.charkoal"
vscode "charliermarsh.ruff"
vscode "chrislajoie.vscode-modelines"
vscode "christian-kohler.npm-intellisense"
vscode "coder.coder-remote"
vscode "codezombiech.gitignore"
vscode "coenraads.disableligatures"
vscode "colder.source-map-visualization"
vscode "continue.continue"
vscode "crystal-lang-tools.crystal-lang"
vscode "csstools.postcss"
vscode "dansnow.vscode-dockerfilelint"
vscode "darkriszty.markdown-table-prettify"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dengsir.template-generator-vscode"
vscode "dioxuslabs.dioxus"
vscode "dkundel.vscode-new-file"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "drkryz.rustautomod"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "efanzh.graphviz-preview"
vscode "effectful-tech.effect-vscode"
vscode "elijah-potter.harper"
vscode "esbenp.prettier-vscode"
vscode "fallenwood.viml"
vscode "felixfbecker.css-stacking-contexts"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "fregante.ghost-text"
vscode "fwcd.kotlin"
vscode "gaborv.flatbuffers"
vscode "gavinleroy.argus"
vscode "gerane.theme-dark-dracula"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "growthbook.growthbook"
vscode "hars.cppsnippets"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "heybourn.headwind"
vscode "highagency.pencildev"
vscode "hverlin.mise-vscode"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "inlang.vs-code-extension"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "jerryhong.autofilename"
vscode "jock.svg"
vscode "joffreykern.markdown-toc"
vscode "johnpapa.vscode-peacock"
vscode "josetr.cmake-language-support-vscode"
vscode "jsonhero.jsonhero-vscode"
vscode "junstyle.php-cs-fixer"
vscode "jzarzoso.break-from-comma"
vscode "kahole.magit"
vscode "kaiwood.endwise"
vscode "kamikillerto.vscode-colorize"
vscode "karunamurti.tera"
vscode "kisstkondoros.vscode-codemetrics"
vscode "legalfina.npm-version-lens"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "lokalise.i18n-ally"
vscode "marimo-team.vscode-marimo"
vscode "marko-js.marko-vscode"
vscode "markwhen.markwhen"
vscode "mathcale.theme-dracula-refined"
vscode "mathiasfrohlich.kotlin"
vscode "matthewpi.caddyfile-support"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "meshintelligenttechnologiesinc.pieces-vscode"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "mitaki28.vscode-clang"
vscode "mitsuhiko.insta"
vscode "moonrepo.moon-console"
vscode "mrmlnc.vscode-attrs-sorter"
vscode "mrmlnc.vscode-json5"
vscode "mrmomo.meson-build"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "muhammad-ahmad.xlsx-viewer"
vscode "nefrob.vscode-just-syntax"
vscode "nhoizey.gremlins"
vscode "nickdemayo.vscode-json-editor"
vscode "nicoespeon.abracadabra"
vscode "nuxt.mdc"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "oxc.oxc-vscode"
vscode "panicbit.cargo"
vscode "petermekhaeil.vscode-tailwindcss-explorer"
vscode "pflannery.vscode-versionlens"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "pomsky-lang.pomsky-vscode"
vscode "prql-lang.prql-vscode"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "rbuckton.deoptexplorer-vscode"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rikurouvila.typehole"
vscode "rofrol.monokai-ocean"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "seanwu.apache-arrow"
vscode "shadowtime2000.eta-vscode"
vscode "shan.code-settings-sync"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sirtobi.pegjs-language"
vscode "sleistner.vscode-fileutils"
vscode "slint.slint"
vscode "sourcegraph.cody-ai"
vscode "sst-dev.opencode"
vscode "statelyai.stately-vscode"
vscode "stephanvs.dot"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "surajbarkale.ninja"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
vscode "syler.sass-indented"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tekumara.typos-vscode"
vscode "tendoualice.markdown-obsidian-callout"
vscode "terrastruct.d2"
vscode "tfsec.tfsec"
vscode "thang-nm.flow-icons"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tonka3000.raycast"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "typespec.typespec-vscode"
vscode "ultram4rine.vscode-choosealicense"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualjj.visualjj"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "vue.volar"
vscode "waderyan.babelrc"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.quokka-vscode"
vscode "william-voyek.vscode-nginx"
vscode "windmill-labs.windmill"
vscode "wmaurer.change-case"
vscode "xmonader.vscode-capnp"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "zenclabs.previewjs"
vscode "zeplin.zeplin"

go "github.com/ayn2op/discordo"
go "github.com/jimschubert/delete-artifacts/cmd"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

cargo "argus-cli"
cargo "skill-manager"

uv "dotbins"
uv "magika"
# vim: ft=ruby
